ci4/app/Cells/ArtikelTerkini.php

SELECT `artikel`.*
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `kategori`.`slug_kategori` = 'teknologi'
ORDER BY `artikel`.`created_at` DESC
 LIMIT 5
---
    public function render(string $kategori = 'teknologi')
    {
        $model = new ArtikelModel();
        $artikel = $model
            ->select('artikel.*')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->where('kategori.slug_kategori', $kategori)
            ->orderBy('artikel.created_at', 'DESC')
            ->limit(5)
            ->findAll();