ci4/app/Cells/KategoriList.php

    public function render()
    {
        $model = new KategoriModel();
        $kategori = $model->findAll();
---
SELECT *
FROM `kategori`