ci4/app/Controllers/Artikel.php

    public function view($slug)
    {
        $model           = new ArtikelModel();
        $data['artikel'] = $model->db->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left')
            ->where('artikel.slug', $slug)
            ->get()
            ->getRowArray();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`slug` = 'artikel-pertama'

            'q'           => $q,
            'kategori_id' => $kategori_id,
            'artikel'     => $artikel,
            'kategori'    => $kategoriModel->findAll(),
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $model         = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($this->request->getMethod() == 'post' && $isDataValid) {
            $updateData = [
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori'),
            ];

            // Handle file upload gambar
            $file = $this->request->getFile('gambar');
            if ($file && $file->isValid() && !$file->hasMoved()) {
                $file->move(ROOTPATH . 'public/gambar');
                $updateData['gambar'] = $file->getName();
            }

            $model->update($id, $updateData);
            return redirect()->to('/admin/artikel');
        }

        return view('artikel/form_edit', [
            'title'    => 'Edit Artikel',
            'artikel'  => $model->find($id),
            'kategori' => $kategoriModel->findAll(),
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '3'
SELECT *
FROM `kategori`