ci4/app/Controllers/Api/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin@email.com'
OR `useremail` = 'admin@email.com'
 LIMIT 1
---
    public function login()
    {
        // 1. Menerima data input dari request body JSON
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $model = new UserModel();

        // 2. Cari user berdasarkan username atau email di database
        $user = $model->where('username', $username)
                      ->orWhere('useremail', $username)
                      ->first();